import { Props as PropsComment } from 'src/components/atoms/Comment';
import { Props as CardProps } from 'src/components/molecules/Card';
import { Props as FullItemCardProps } from 'src/components/molecules/FullItemCard';
import { Props as ItemCardProps } from 'src/components/molecules/ItemCard';

export const items: FullItemCardProps[] = [
  {
    imageSrc: 'https://i.ibb.co/3CYf6Mn/image-114.png',
    price: 120,
    title: 'лучший день',
    description:
      'Завораживающая глубина ваших чувств передана огненными красками этого букета',
    compound:
      'Гвоздика (Диантус), Леукодендрон, Леукоспермум (Нутан), Лотос, Роза',
    categories: [
      '8 марта',
      'Букет на 14 февраля',
      'Букет на праздник',
      'Букеты цветов на День рождения',
      'Композиции из цветов',
      'Композиции из цветов в коробке',
    ],
    labels: ['Для начальника', 'Мужские букеты'],
  },
  {
    imageSrc: 'https://i.ibb.co/nkc4zHN/image-130.png',
    price: 120,
    title: 'лучший день',
    description:
      'Завораживающая глубина ваших чувств передана огненными красками этого букета',
    compound:
      'Гвоздика (Диантус), Леукодендрон, Леукоспермум (Нутан), Лотос, Роза',
    categories: [
      '8 марта',
      'Букет на 14 февраля',
      'Букет на праздник',
      'Букеты цветов на День рождения',
      'Композиции из цветов',
      'Композиции из цветов в коробке',
    ],
    labels: ['Для начальника', 'Мужские букеты'],
  },
  {
    imageSrc: 'https://i.ibb.co/FmctFzN/image-131.png',
    price: 120,
    title: 'лучший день',
    description:
      'Завораживающая глубина ваших чувств передана огненными красками этого букета',
    compound:
      'Гвоздика (Диантус), Леукодендрон, Леукоспермум (Нутан), Лотос, Роза',
    categories: [
      '8 марта',
      'Букет на 14 февраля',
      'Букет на праздник',
      'Букеты цветов на День рождения',
      'Композиции из цветов',
      'Композиции из цветов в коробке',
    ],
    labels: ['Для начальника', 'Мужские букеты'],
  },
  {
    imageSrc: 'https://i.ibb.co/ZhRQGhM/image-132.png',
    price: 120,
    title: 'лучший день',
    sale: 100,
    description:
      'Завораживающая глубина ваших чувств передана огненными красками этого букета',
    compound:
      'Гвоздика (Диантус), Леукодендрон, Леукоспермум (Нутан), Лотос, Роза',
    categories: [
      '8 марта',
      'Букет на 14 февраля',
      'Букет на праздник',
      'Букеты цветов на День рождения',
      'Композиции из цветов',
      'Композиции из цветов в коробке',
    ],
    labels: ['Для начальника', 'Мужские букеты'],
  },
  {
    imageSrc: 'https://i.ibb.co/pwC5mFY/image-133.png',
    price: 120,
    title: 'лучший день',
    description:
      'Завораживающая глубина ваших чувств передана огненными красками этого букета',
    compound:
      'Гвоздика (Диантус), Леукодендрон, Леукоспермум (Нутан), Лотос, Роза',
    categories: [
      '8 марта',
      'Букет на 14 февраля',
      'Букет на праздник',
      'Букеты цветов на День рождения',
      'Композиции из цветов',
      'Композиции из цветов в коробке',
    ],
    labels: ['Для начальника', 'Мужские букеты'],
  },
  {
    imageSrc: 'https://i.ibb.co/myLZ3wr/image-134.png',
    price: 120,
    title: 'лучший день',
    sale: 110,
    description:
      'Завораживающая глубина ваших чувств передана огненными красками этого букета',
    compound:
      'Гвоздика (Диантус), Леукодендрон, Леукоспермум (Нутан), Лотос, Роза',
    categories: [
      '8 марта',
      'Букет на 14 февраля',
      'Букет на праздник',
      'Букеты цветов на День рождения',
      'Композиции из цветов',
      'Композиции из цветов в коробке',
    ],
    labels: ['Для начальника', 'Мужские букеты'],
  },
  {
    imageSrc: 'https://i.ibb.co/bFf2s5T/image-135.png',
    price: 120,
    title: 'лучший день',
    description:
      'Завораживающая глубина ваших чувств передана огненными красками этого букета',
    compound:
      'Гвоздика (Диантус), Леукодендрон, Леукоспермум (Нутан), Лотос, Роза',
    categories: [
      '8 марта',
      'Букет на 14 февраля',
      'Букет на праздник',
      'Букеты цветов на День рождения',
      'Композиции из цветов',
      'Композиции из цветов в коробке',
    ],
    labels: ['Для начальника', 'Мужские букеты'],
  },
  {
    imageSrc: 'https://i.ibb.co/TrwRGC5/image-136.png',
    price: 120,
    title: 'лучший день',
    description:
      'Завораживающая глубина ваших чувств передана огненными красками этого букета',
    compound:
      'Гвоздика (Диантус), Леукодендрон, Леукоспермум (Нутан), Лотос, Роза',
    categories: [
      '8 марта',
      'Букет на 14 февраля',
      'Букет на праздник',
      'Букеты цветов на День рождения',
      'Композиции из цветов',
      'Композиции из цветов в коробке',
    ],
    labels: ['Для начальника', 'Мужские букеты'],
  },
  {
    imageSrc: 'https://i.ibb.co/H78nbWM/image-137.png',
    price: 120,
    title: 'лучший день',
    sale: 110,
    description:
      'Завораживающая глубина ваших чувств передана огненными красками этого букета',
    compound:
      'Гвоздика (Диантус), Леукодендрон, Леукоспермум (Нутан), Лотос, Роза',
    categories: [
      '8 марта',
      'Букет на 14 февраля',
      'Букет на праздник',
      'Букеты цветов на День рождения',
      'Композиции из цветов',
      'Композиции из цветов в коробке',
    ],
    labels: ['Для начальника', 'Мужские букеты'],
  },
  {
    imageSrc: 'https://i.ibb.co/TwS0nxt/image-138.png',
    price: 120,
    title: 'лучший день',
    description:
      'Завораживающая глубина ваших чувств передана огненными красками этого букета',
    compound:
      'Гвоздика (Диантус), Леукодендрон, Леукоспермум (Нутан), Лотос, Роза',
    categories: [
      '8 марта',
      'Букет на 14 февраля',
      'Букет на праздник',
      'Букеты цветов на День рождения',
      'Композиции из цветов',
      'Композиции из цветов в коробке',
    ],
    labels: ['Для начальника', 'Мужские букеты'],
  },
  {
    imageSrc: 'https://i.ibb.co/r3Dr1g4/image-139.png',
    price: 120,
    title: 'лучший день',
    sale: 100,
    description:
      'Завораживающая глубина ваших чувств передана огненными красками этого букета',
    compound:
      'Гвоздика (Диантус), Леукодендрон, Леукоспермум (Нутан), Лотос, Роза',
    categories: [
      '8 марта',
      'Букет на 14 февраля',
      'Букет на праздник',
      'Букеты цветов на День рождения',
      'Композиции из цветов',
      'Композиции из цветов в коробке',
    ],
    labels: ['Для начальника', 'Мужские букеты'],
  },
  {
    imageSrc: 'https://i.ibb.co/vY01XCG/image-140.png',
    price: 120,
    title: 'лучший день',
    description:
      'Завораживающая глубина ваших чувств передана огненными красками этого букета',
    compound:
      'Гвоздика (Диантус), Леукодендрон, Леукоспермум (Нутан), Лотос, Роза',
    categories: [
      '8 марта',
      'Букет на 14 февраля',
      'Букет на праздник',
      'Букеты цветов на День рождения',
      'Композиции из цветов',
      'Композиции из цветов в коробке',
    ],
    labels: ['Для начальника', 'Мужские букеты'],
  },
];

export const dataCards: CardProps[] = [
  {
    type: 'additional',
    description:
      'При указании об этом в пожеланиях к букету, мы приложим пакетик удобрения для вас',
    title: 'Удобрения для срезанных цветов',
  },
  {
    type: 'additional',
    description:
      'В пожеланиях к букету укажите текст, какой хотите разместить и выберите на сайте саму открытку',
    title: 'подпишем открытку',
  },
  {
    type: 'additional',
    description:
      'В примечании к заказу укажите об этом и мы отправим фото готового букета перед доставкой. В праздничные дни в связи с большой загруженностью такой возможности нет',
    title: 'Фото букета перед отправкой',
  },
  {
    type: 'additional',
    description:
      'Если хотите, чтобы получатель не знал, что ему вручат а также от кого, то укажите об этом в примечании к заказу',
    title: 'Букет-сюрприз',
  },
];

export const commentsData: PropsComment[][] = [
  [
    {
      author: 'Иван',
      date: '10/10/2021',
      rate: 5,
      text: 'Лучшая доставка цветов в городе! Быстро доставили, привезли к нужному времени, а сам букет превзошел все ожидания!',
    },
    {
      author: 'Иван',
      date: '10/10/2021',
      rate: 4,
      text: 'Лучшая доставка цветов в городе! Быстро доставили, привезли к нужному времени, а сам букет превзошел все ожидания!',
    },
    {
      author: 'Иван',
      date: '10/10/2021',
      rate: 4,
      text: 'Лучшая доставка цветов в городе! Быстро доставили, привезли к нужному времени, а сам букет превзошел все ожидания!',
    },
    {
      author: 'Иван',
      date: '10/10/2021',
      rate: 5,
      text: 'Лучшая доставка цветов в городе! Быстро доставили, привезли к нужному времени, а сам букет превзошел все ожидания!',
    },
  ],
  [],
];

export const carouselData: ItemCardProps[] = [
  {
    imageSrc: 'https://i.ibb.co/bFf2s5T/image-135.png',
    price: 120,
    title: 'лучший день',
  },
  {
    imageSrc: 'https://i.ibb.co/TrwRGC5/image-136.png',
    price: 120,
    title: 'лучший день',
  },
  {
    imageSrc: 'https://i.ibb.co/H78nbWM/image-137.png',
    price: 120,
    title: 'лучший день',
    sale: 110,
    type: 'sale',
  },
  {
    imageSrc: 'https://i.ibb.co/r3Dr1g4/image-139.png',
    price: 120,
    title: 'лучший день',
    sale: 100,
    type: 'sale',
  },
];
